* Example
Here is an example of a global search overlapping genes
#+begin_src bash :results output
python ./src/bin/overgenes.py global test_data/seq_x.fa test_data/seq_y.fa -m blosum90 -f -2
#+end_src

#+RESULTS:
#+begin_example
# GAP_PEN -2.0
# GAP_OPEN -16.0
# MAT blosum90
# FRAME -2
# NAMEX SEQ_X_PRIME
# NAMEY SEQ_Y_PRIME
# DCA false
# SCORE 491.0
# STARTX 20
# STARTY 0
# ENDX 103
# ENDY 83

>SEQ_X_PRIME/20-103
VQLTKEEGKSLGFSVVGLKSEERGELGLFVSEVQPGGFGAQDGQLQESDQLLAIDRTPLADHLAHQNPLAVLQKQTGLVHLVL--------------------
VQLTKEEGKSLGFSVVGLKSEERGELGLFVSEVQPGGFGAQDGQLQESDQLLAIDRTPLADHLAHQNPLAVLQKQTGLVHLVL--------------------

>SEQ_Y_PRIME/0-83
VQLTKEEGKSLGFSVVGLKSEGRGELGLFVSEVQPGGFGAQDGQLEESDQLLAIDRSPVADHLAHQNPLAVLQKQTGLVRLVL--------------------
VQLTKEEGKSLGFSVVGLKSEGRGELGLFVSEVQPGGFGAQDGQLEESDQLLAIDRSPVADHLAHQNPLAVLQKQTGLVRLVL--------------------


Y   -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  L  V  L  R  V  L
Y'  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  L  V  L  R  V  L
  CATGTTGATTGTTTTCTTCTTCCTTTTTCGGATCCTAAGTCGCATCATCCTGATTTTTCGCTTCTTGCTCCGCTTGATC
  GTACAACTAACAAAAGAAGAAGGAAAAAGCCTAGGATTCAGCGTAGTAGGACTAAAAAGCGAAGAACGAGGCGAACTAG
X' V  Q  L  T  K  E  E  G  K  S  L  G  F  S  V  V  G  L  K  S  E  E  R  G  E  L
X  V  Q  L  T  K  E  E  G  K  S  L  G  F  S  V  V  G  L  K  S  E  E  R  G  E  L

Y   G  T  Q  K  Q  L  V  A  L  P  N  Q  H  A  L  H  D  A  V  P  S  R  D  I  A  L
Y'  G  T  Q  K  Q  L  V  A  L  P  N  Q  H  A  L  H  D  A  V  P  S  R  D  I  A  L
  CCGGACAAACAAAGACTTCATGTCGGTCCCCCAAAACCACGCGTTCTACCAGTCGATGTCCTCTCGCTAGTTAACGATC
  GGCCTGTTTGTTTCTGAAGTACAGCCAGGGGGTTTTGGTGCGCAAGATGGTCAGCTACAGGAGAGCGATCAATTGCTAG
X' G  L  F  V  S  E  V  Q  P  G  G  F  G  A  Q  D  G  Q  L  Q  E  S  D  Q  L  L
X  G  L  F  V  S  E  V  Q  P  G  G  F  G  A  Q  D  G  Q  L  Q  E  S  D  Q  L  L

Y   L  Q  D  S  E  E  L  Q  G  D  Q  A  G  F  G  G  P  Q  V  E  S  V  F  L  G  L
Y'  L  Q  D  S  E  E  L  Q  G  D  Q  A  G  F  G  G  P  Q  V  E  S  V  F  L  G  L
  CGTTAACTAGCCTGAGGAGATCGACTGGTAGAACGCGTGGTTTTGGGGGACCGACATGAAGTCTTTGTTTGTCCGGATC
  GCAATTGATCGGACTCCTCTAGCTGACCATCTTGCGCACCAAAACCCCCTGGCTGTACTTCAGAAACAAACAGGCCTAG
X' A  I  D  R  T  P  L  A  D  H  L  A  H  Q  N  P  L  A  V  L  Q  K  Q  T  G  L
X  A  I  D  R  T  P  L  A  D  H  L  A  H  Q  N  P  L  A  V  L  Q  K  Q  T  G  L

Y   E  G  R  G  E  S  K  L  G  V  V  S  F  G  L  S  K  G  E  E  K  T  L  Q  V
Y'  E  G  R  G  E  S  K  L  G  V  V  S  F  G  L  S  K  G  E  E  K  T  L  Q  V
  CAAGTGGAGCAGGAAGTCTGAAGTTTGGTTGTTGTCTTTTTGGGTTTCTGAATGGGAGGAGGAATCAGTTGACTTG
  GTTCACCTCGTCCTTCAGACTTCAAACCAACAACAGAAAAACCCAAAGACTTACCCTCCTCCTTAGTCAACTGAAC
X' V  H  L  V  L  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -
X  V  H  L  V  L  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -


#+end_example


You can also output the results in an html file:

#+begin_src bash :results output
python ./src/bin/overgenes.py global test_data/seq_x.fa test_data/seq_y.fa -m blosum90 -f -2 -o test_data/seq_x_seq_y_out.html
#+end_src

#+RESULTS:

